# Характеристика объекта Супермаркет
# Возьмём абстрактный супермаркет

# >>> Характеристику супермаркета типом String
marketName = 'Мегамолл'; # Название супермаркета
marketPlace = 'Привокзальная 21'; # Расположение супермаркета
marketTime = '08.00 - 19.00'; # Время работы
marketPhone = '+380442124589'; # Номер телефона супермаркета
marketCity = 'Винница'; # Город в котором размещён супермаркет 

# >>> Характеристику супермаркета типом Float
dayMoney = 540.67; # Выручка в тыс. грн
marketArea = 55.1; # Площадь супермаркета в тыс.м2
humanCount = 9.3; # Количество посещений в тыс. в день
carPlaceArea = 15.2; # Площадь стоянки в тыс. м2
marketCount = 0.243; # Количество магазинов в супермаркете в тыс.

# >>> Характеристику супермаркета типом Integer
parkingPlaceCount = 210; # Количество парковочных мест
yearOfBuilding = 2020; # Год постройки
cartCount = 480; # Количество тележек
floorCount = 2; # Количество этажей
countOfDoor = 12; # Количество дверей

# Вывод информации
print("Характеристика супермаркет, типом str", 
"\r\nНазвание супермаркета:", marketName, 
"\r\nРасположение супермаркета:", marketPlace, 
"\r\nВремя работы:", marketTime, 
"\r\nНомер телефона супермаркета:", marketPhone, 
"\r\nГород в котором размещён супермаркет:", marketCity,
"\r\n<====================================>\r\n");
# Вывод информации
print("Характеристика супермаркет, типом float", 
"\r\nВыручка за день:", dayMoney, "тыс. грн", 
"\r\nПлощадь супермаркета: ", marketArea, "тыс.м2", 
"\r\nКоличество посещений:", humanCount, "тыс/день",
"\r\nПлощадь стоянки:", carPlaceArea, "тыс.м2",
"\r\nКоличество магазинов в супермаркете: ", marketCount, "тыс", 
"\r\n<====================================>\r\n");
# Вывод информации
print("Характеристика супермаркет int", 
"\r\nКоличество парковочных мест для машин:", parkingPlaceCount, 
"\r\nГод постройки супермаркета:", yearOfBuilding, 
"\r\nКоличество тележек в супермаркете:", cartCount, 
"\r\nоличество этажей в супермаркете: ", floorCount, 
"\r\nКоличество дверей в супермаркете:", countOfDoor, 
"\r\n<====================================>");