# Задание: Книга / Супермаркет / Компьютерная игра
# Переменные типа int
gameStats = "Сеттинг, Геймплей, Музыка"; #Составляющие компьютерной игры
gamedefinition = "компьютерная программа, служащая для организации игрового процесса (геймплея), связи с партнёрами по игре, или сама выступающая в качестве партнёра."; #Определение компьютерной игры
gamePlatform = "Игровые автоматы, консоли, онлайн-игра, консольная игра, мобильная игра, ПК-игра"; # Игровые платформы
nameOfFirstGame = "Nimatron"; # Название первой игры
gameGenre = "Action, Action-adventure, Adventure, Ролевая игра, Симулятор, Спортивная игра, Стратегическая игра, Звуковая игра"; # Жанри компьютерних игр

# Переменные типа float 
countOfAllGames = 187.2; # Количество игр в мире, в миллионах 
countOfMobileGameOnMarket = 47.2; # Количество мобильных игр на рынке, в % 
gameSizeMiddle = 1.1; # Средний вес игры в Gb 
countOfPlayers = 976.5; # Количество людей, играюбщих в игры, в млн. 
marketYearPart = 25.2; # Процент компьютерных игр на рынке 

# Переменные типа int
yearFirstStrategy = 1992; # Год, когда вышла первая стратегия
yearOfFirstGame = 1939; # Год создания первой игры
countOfGameGenre = 8; # Количество жанров игр
countOfPlayGamesYumans = 357; # Среднее количество комп. игр, в которое играет челове за свою жизнь
yearOfRevolution = 2000; # Год, в котором произошла революция графики в играх

# Вывод информации
print("Характеристика комп. игры, типом str", 
"\r\nКомпьютерная игра - это ", gamedefinition, 
"\r\nСоставляющие компьютерной игры", gameStats, 
"\r\nСписок игровых платформ:", gamePlatform, 
"\r\nНазвание первой игры:", nameOfFirstGame, 
"\r\nИгровые жанры:", gameGenre, 
"\r\n<====================================>\r\n");
# Вывод информации
print("Характеристика комп. игры, типом float", 
"\r\nКоличество игр в мире, в миллионах", countOfAllGames, 
"\r\nКоличество мобильных игр на рынке: ", countOfMobileGameOnMarket, "%", 
"\r\nСредний вес игры:", gameSizeMiddle, "Gb",
"\r\nКоличество людей, играюбщих в игры:", countOfPlayers, "млн.",
"\r\nПроцент компьютерных игр на рынке: ", marketYearPart, "%", 
"\r\n<====================================>\r\n");
# Вывод информации
print("Характеристика комп. игры, типом int", 
"\r\nГод, когда вышла первая стратегия", yearFirstStrategy, 
"\r\nГод создания первой игры", yearOfFirstGame, 
"\r\nКоличество жанров игр", countOfGameGenre, 
"\r\nСреднее количество комп. игр, в которое играет челове за свою жизнь: ", countOfPlayGamesYumans, 
"\r\nГод, в котором произошла революция графики в играх:", yearOfRevolution, 
"\r\n<====================================>");